{
  "projects": [
    {
      "id": "proje_1_oyun",
      "name": "proje_1_oyun",
      "path": "/Users/muharremdedeoglu/Development/Ralp-pipeline-2/ralph-pipeline-manager/proje_1_oyun",
      "prd": {
        "project": "Cube Dash 3D",
        "description": "Build a small but complete web-based 3D endless runner/dodge game using Three.js in a single HTML file. The player controls a cube moving left/right to avoid incoming obstacles, with score increasing over survival time, progressive difficulty, basic audio feedback, and a polished but simple visual style.",
        "stories": [
          {
            "title": "Define Single-File Game Architecture",
            "description": "Create one self-contained HTML file with embedded CSS and JavaScript. Include Three.js latest stable CDN import, initialize global game state, and structure code into clear beginner-friendly functions such as init, animate, handleInput, spawnObstacle, updateObstacles, detectCollision, updateScore, setGameOver, and restartGame.",
            "passes": false
          },
          {
            "title": "Initialize 3D Scene and Rendering Pipeline",
            "description": "Set up Three.js scene, perspective camera, and renderer. Configure renderer sizing, pixel ratio, and append canvas to the document. Implement responsive resize handling to maintain correct aspect ratio and viewport behavior.",
            "passes": false
          },
          {
            "title": "Implement Lighting and Environment",
            "description": "Add ambient and directional lights for clear visibility and depth. Create a ground plane with a colorful but clean material. Ensure scene composition is visually simple, readable, and polished.",
            "passes": false
          },
          {
            "title": "Create Player Cube with Smooth Movement",
            "description": "Add a player cube mesh with colorful material. Implement lane-based or bounded horizontal movement using ArrowLeft/ArrowRight and A/D keys. Use lerp-based smoothing so movement feels fluid rather than instant.",
            "passes": false
          },
          {
            "title": "Build Obstacle Spawning System",
            "description": "Generate obstacles at random horizontal positions ahead of the player and move them toward the camera/player over time. Manage obstacle lifecycle by removing off-screen objects to avoid memory/performance issues.",
            "passes": false
          },
          {
            "title": "Add Collision Detection and Failure Logic",
            "description": "Detect overlap between player and obstacles using bounding checks (e.g., Box3 or simplified AABB). Trigger game-over state immediately on collision, halt active gameplay updates, and present restart prompt.",
            "passes": false
          },
          {
            "title": "Implement Score and Difficulty Progression",
            "description": "Increase score continuously based on survival time and display it in real time. Scale difficulty over time by increasing obstacle speed and/or spawn frequency while keeping progression smooth and fair.",
            "passes": false
          },
          {
            "title": "Deliver Game State Management and Restart Flow",
            "description": "Support at least two states: playing and game over. On restart input (e.g., R key or Enter), reset score, timers, obstacle arrays, player position, speed scaling, and UI state without reloading the page.",
            "passes": false
          },
          {
            "title": "Implement HTML Overlay UI",
            "description": "Create lightweight HTML overlay for score and game-over text above the WebGL canvas. Ensure clear typography, contrast, and placement. Show/hide messages based on game state transitions.",
            "passes": false
          },
          {
            "title": "Add Simple Animations for Visual Polish",
            "description": "Introduce subtle animation effects such as obstacle rotation, player bounce/tilt, or scene motion accents. Keep animations lightweight and readable to maintain beginner-friendly code and stable performance.",
            "passes": false
          },
          {
            "title": "Integrate Basic Sound Effects with Web Audio API",
            "description": "Use Web Audio API to synthesize simple SFX (e.g., movement blip, score tick cadence, collision/game-over tone). Ensure audio initialization complies with browser gesture requirements and does not require external audio files.",
            "passes": false
          },
          {
            "title": "Enforce Code Quality and Delivery Requirements",
            "description": "Comment key logic clearly, keep naming and function boundaries clean, and maintain readability for beginners. Ensure final output is a fully working standalone HTML game with no external frameworks beyond Three.js CDN.",
            "passes": false
          }
        ]
      },
      "status": "completed",
      "createdAt": "2026-02-05T23:19:25.739Z",
      "updatedAt": "2026-02-05T23:57:28.757Z"
    },
    {
      "id": "Dice_game",
      "name": "Dice_game",
      "path": "/Users/muharremdedeoglu/Development/Ralp-pipeline-2/ralph-pipeline-manager/projects/Dice_game",
      "prd": {
        "project": "Web-Based 3D Dice Roller (Three.js, Single-File)",
        "description": "Build a beginner-friendly, single-file HTML application that renders a procedural 3D dice on a table using Three.js and allows users to roll it via button click or Space key. The dice should animate with smooth, physical-feeling motion, then stop on a valid randomly selected face (1-6) and display the result clearly in the UI.",
        "stories": [
          {
            "title": "Initialize single-file app with Three.js from CDN",
            "description": "Create one self-contained HTML file using pure HTML, CSS, and vanilla JavaScript. Load latest stable Three.js from CDN. Do not use frameworks or external assets.",
            "passes": true
          },
          {
            "title": "Set up core 3D scene",
            "description": "Implement scene, perspective camera, and WebGL renderer. Add responsive canvas behavior that resizes with the window. Keep OrbitControls optional and only include if it does not add complexity.",
            "passes": true
          },
          {
            "title": "Create procedural table environment",
            "description": "Add a subtle-colored ground plane to represent a table. Configure ambient and directional lighting with shadows enabled so the dice casts a visible shadow.",
            "passes": true
          },
          {
            "title": "Build procedural dice model without textures/models",
            "description": "Create a cube-based dice with white body and dark pips, fully generated in code. Implement pips using either CanvasTexture per face or pip meshes placed on faces.",
            "passes": true
          },
          {
            "title": "Implement roll interaction controls",
            "description": "Add HTML overlay UI with a 'ROLL' button and keyboard shortcut (Space) to trigger rolling. Prevent repeated roll input while an active roll animation is in progress.",
            "passes": true
          },
          {
            "title": "Animate dice roll with physical feel",
            "description": "Implement roll animation with easing (damped/tween-like interpolation), including a subtle shake or bounce effect to improve perceived realism.",
            "passes": true
          },
          {
            "title": "Ensure valid deterministic final face result",
            "description": "On each roll, randomly select an integer 1-6, animate motion, and smoothly snap dice orientation so the selected face is clearly up at animation end. Ensure final state is valid and unambiguous.",
            "passes": true
          },
          {
            "title": "Display result and rolling status",
            "description": "Show 'Result: X' text that updates after each completed roll and a subtle status indicator such as 'Rolling...' while animation is active.",
            "passes": true
          },
          {
            "title": "Organize code for readability and maintainability",
            "description": "Structure implementation into beginner-friendly functions such as init(), createDice(), rollDice(), animate(), and setDiceToFace(n). Add clear comments on key logic paths.",
            "passes": true
          },
          {
            "title": "Validate final output constraints",
            "description": "Confirm deliverable is only one fully working HTML file with no external assets, no frameworks, and behavior that matches all scene, interaction, animation, and UI requirements.",
            "passes": true
          }
        ]
      },
      "status": "completed",
      "createdAt": "2026-02-06T00:18:33.564Z",
      "updatedAt": "2026-02-06T00:31:29.241Z"
    }
  ],
  "settings": {
    "maxIterations": 100,
    "codexPath": "codex"
  }
}